--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/mwatson/Dropbox/TB/4E/WebSupplements/ForStudents/SW_4E_ReplicationFiles/Chapter_10/ch10.log
  log type:  text
 opened on:  24 Sep 2018, 15:06:55

. ***********************************;
. * Read In Data;
.  use "/Users/mwatson/Dropbox/TB/4E/WebSupplements/ForStudents/SW_4E_ReplicationFiles/Replication_Data/fatality.dta";

. desc;

Contains data from /Users/mwatson/Dropbox/TB/4E/WebSupplements/ForStudents/SW_4E_ReplicationFiles/Replication_Data/fatality.dta
  obs:           336                          
 vars:            43                          29 Dec 2010 19:38
 size:        46,704                          
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
state           byte    %9.0g      sid        State ID (FIPS) Code
year            int     %9.0g                 Year
spircons        float   %9.0g                 Spirits Consumption
unrate          float   %9.0g                 Unemployment Rate
perinc          float   %9.0g                 Per Capita Personal Income
emppop          float   %9.0g                 Employment/Population Ratio
beertax         float   %9.0g                 Tax on Case of Beer
sobapt          float   %9.0g                 % Southern Baptist
mormon          float   %9.0g                 % Mormon
mlda            float   %9.0g                 Minimum Legal Drinking Age
dry             float   %9.0g                 % Residing in Dry Counties
yngdrv          float   %9.0g                 % of Drivers Aged 15-24
vmiles          float   %9.0g                 Ave. Mile per Driver
breath          byte    %9.0g                 Prelim. Breath Test Law
jaild           byte    %9.0g                 Mandatory Jail Sentence
comserd         byte    %9.0g                 Mandatory Community Service
allmort         int     %9.0g                 # of Vehicle Fatalities (#VF)
mrall           float   %9.0g                 Vehicle Fatality Rate (VFR)
allnite         int     %9.0g                 # of Night-time VF (#NVF)
mralln          float   %9.0g                 Night-time VFR (NFVR)
allsvn          int     %9.0g                 # of Single VF (#SVN)
a1517           int     %9.0g                 #VF, 15-17 year olds
mra1517         float   %9.0g                 VFR, 15-17 year olds
a1517n          byte    %9.0g                 #NVF, 15-17 year olds
mra1517n        float   %9.0g                 NVFR, 15-17 year olds
a1820           int     %9.0g                 #VF, 18-20 year olds
a1820n          int     %9.0g                 #NVF, 18-20 year olds
mra1820         float   %9.0g                 VFR, 18-20 year olds
mra1820n        float   %9.0g                 NVFR, 18-20 year olds
a2124           int     %9.0g                 #VF, 21-24 year olds
mra2124         float   %9.0g                 VFR, 21-24 year olds
a2124n          int     %9.0g                 #NVF, 21-24 year olds
mra2124n        float   %9.0g                 NVFR, 21-24 year olds
aidall          float   %9.0g                 # of alcohol-involved VF
mraidall        float   %9.0g                 Alcohol-Involved VFR
pop             float   %9.0g                 Population
pop1517         float   %9.0g                 Population, 15-17 year olds
pop1820         float   %9.0g                 Population, 18-20 year olds
pop2124         float   %9.0g                 Population, 21-24 year olds
miles           float   %9.0g                 total vehicle miles (millions
unus            float   %9.0g                 U.S. unemployment rate
epopus          float   %9.0g                 U.S. Emp/Pop Ratio
gspch           float   %9.0g                 GSP Rate of Change
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: 

. ************************************************************;
. * summary statistics;
. summ year;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |        336        1985    2.002983       1982       1988

. summ state;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       state |        336     30.1875    15.30985          1         56

. ************************************************************;
. * Data transformations, create dummy variables, etc.
> * year dummies;
. gen y82=(year==1982);

. gen y83=(year==1983);

. gen y84=(year==1984);

. gen y85=(year==1985);

. gen y86=(year==1986);

. gen y87=(year==1987);

. gen y88=(year==1988);

. gen da18=(mlda<19);

.                 * minimum legal drinking age;
. gen da19=(mlda>=19)*(mlda<20);

. gen da20=(mlda>=20)*(mlda<21);

. gen da21=(mlda>=21);

. gen vfrall=10000*mrall;

.   *fatality rate per 10,000 in the population;
. gen incperc=perinc/1000;

. gen lincperc = ln(incperc);

. gen vmilespd = vmiles/1000;

. gen frmall = mrall/(vmiles/100000);

. gen jailcom = ((jaild+comserd)>0);

. gen mjailcom = (jaild==.)*(comserd==.);

. mvdecode mjailcom,mv(1);
    mjailcom: 1 missing value generated

. replace jailcom = jailcom + mjailcom;
(1 real change made, 1 to missing)

. **********************************************;
. **** Equation 10.2 ;
. **********************************************;
. reg vfrall beertax if (year==1982), r;

Linear regression                               Number of obs     =         48
                                                F(1, 46)          =       1.25
                                                Prob > F          =     0.2687
                                                R-squared         =     0.0133
                                                Root MSE          =     .67048

------------------------------------------------------------------------------
             |               Robust
      vfrall |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     beertax |   .1484603   .1326054     1.12   0.269    -.1184604    .4153811
       _cons |   2.010381   .1495728    13.44   0.000     1.709307    2.311456
------------------------------------------------------------------------------

.  dis "Adjusted Rsquared = " e(r2_a);
Adjusted Rsquared = -.00812585

. **********************************************;
. **** Equation 10.3 ;
. **********************************************;
. reg vfrall beertax if (year==1988), r;

Linear regression                               Number of obs     =         48
                                                F(1, 46)          =      11.77
                                                Prob > F          =     0.0013
                                                R-squared         =     0.1340
                                                Root MSE          =     .49025

------------------------------------------------------------------------------
             |               Robust
      vfrall |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     beertax |   .4387546   .1278649     3.43   0.001     .1813758    .6961334
       _cons |   1.859073   .1146124    16.22   0.000      1.62837    2.089776
------------------------------------------------------------------------------

.  dis "Adjusted Rsquared = " e(r2_a);
Adjusted Rsquared = .11517682

. **********************************************;
. **** Equation 10.8 ;
. **********************************************;
. preserve;

. gen dvfrall = vfrall-vfrall[_n-6];
(6 missing values generated)

. gen dbtax = beertax-beertax[_n-6];
(6 missing values generated)

. gen dbda18 = da18-da18[_n-6];
(6 missing values generated)

. gen dbda19 = da19-da19[_n-6];
(6 missing values generated)

. gen dbda20 = da20-da20[_n-6];
(6 missing values generated)

. gen dbjailcom = jailcom-jailcom[_n-6];
(8 missing values generated)

. gen dbvmilespd = vmilespd-vmilespd[_n-6];
(6 missing values generated)

. gen dbunrate = unrate-unrate[_n-6];
(6 missing values generated)

. gen dblincperc = lincperc-lincperc[_n-6];
(6 missing values generated)

. keep if year==1988;
(288 observations deleted)

. **** Equation 10.8 ;
. reg dvfrall dbtax, r;

Linear regression                               Number of obs     =         48
                                                F(1, 46)          =       8.60
                                                Prob > F          =     0.0052
                                                R-squared         =     0.1192
                                                Root MSE          =     .39402

------------------------------------------------------------------------------
             |               Robust
     dvfrall |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       dbtax |  -1.040973   .3550062    -2.93   0.005    -1.755563   -.3263822
       _cons |  -.0720371   .0653552    -1.10   0.276    -.2035903    .0595161
------------------------------------------------------------------------------

.  dis "Adjusted Rsquared = " e(r2_a);
Adjusted Rsquared = .10004604

. restore;

. **********************************************;
. **** Equation 10.15 ;
. **********************************************;
. xtset state year;
       panel variable:  state (strongly balanced)
        time variable:  year, 1982 to 1988
                delta:  1 unit

. xtreg vfrall beertax, fe vce(cluster state);

Fixed-effects (within) regression               Number of obs     =        336
Group variable: state                           Number of groups  =         48

R-sq:                                           Obs per group:
     within  = 0.0407                                         min =          7
     between = 0.1101                                         avg =        7.0
     overall = 0.0934                                         max =          7

                                                F(1,47)           =       5.05
corr(u_i, Xb)  = -0.6885                        Prob > F          =     0.0294

                                 (Std. Err. adjusted for 48 clusters in state)
------------------------------------------------------------------------------
             |               Robust
      vfrall |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     beertax |  -.6558736   .2918556    -2.25   0.029    -1.243011   -.0687358
       _cons |   2.377075   .1497966    15.87   0.000     2.075723    2.678427
-------------+----------------------------------------------------------------
     sigma_u |   .7147146
     sigma_e |  .18985942
         rho |  .93408484   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. **********************************************;
. **** Equation 10.21 ;
. **********************************************;
. xtreg vfrall beertax y82 y83 y84 y85 y86 y87, fe vce(cluster state);

Fixed-effects (within) regression               Number of obs     =        336
Group variable: state                           Number of groups  =         48

R-sq:                                           Obs per group:
     within  = 0.0803                                         min =          7
     between = 0.1101                                         avg =        7.0
     overall = 0.0876                                         max =          7

                                                F(7,47)           =       4.36
corr(u_i, Xb)  = -0.6781                        Prob > F          =     0.0009

                                 (Std. Err. adjusted for 48 clusters in state)
------------------------------------------------------------------------------
             |               Robust
      vfrall |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     beertax |  -.6399799   .3570783    -1.79   0.080    -1.358329    .0783691
         y82 |   .0518038   .0644023     0.80   0.425    -.0777568    .1813645
         y83 |  -.0280991   .0528959    -0.53   0.598    -.1345119    .0783138
         y84 |  -.0206167   .0398023    -0.52   0.607    -.1006887    .0594552
         y85 |  -.0721725   .0376438    -1.92   0.061    -.1479021    .0035572
         y86 |   .0139393   .0287262     0.49   0.630    -.0438503     .071729
         y87 |   .0009018   .0287037     0.03   0.975    -.0568427    .0586462
       _cons |   2.376666   .1673381    14.20   0.000     2.040025    2.713307
-------------+----------------------------------------------------------------
     sigma_u |  .70945965
     sigma_e |  .18788295
         rho |  .93446372   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. **********************************************;
. **** Equation Table 10.1 ;
. **********************************************;
. **** col(1);
. reg vfrall beertax, r;

Linear regression                               Number of obs     =        336
                                                F(1, 334)         =      47.59
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0934
                                                Root MSE          =     .54374

------------------------------------------------------------------------------
             |               Robust
      vfrall |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     beertax |   .3646054   .0528524     6.90   0.000     .2606399     .468571
       _cons |   1.853308   .0471297    39.32   0.000     1.760599    1.946016
------------------------------------------------------------------------------

.  dis "Adjusted Rsquared = " e(r2_a);
Adjusted Rsquared = .09064833

. **** col(2);
.  xtreg vfrall beertax, fe vce(cluster state);

Fixed-effects (within) regression               Number of obs     =        336
Group variable: state                           Number of groups  =         48

R-sq:                                           Obs per group:
     within  = 0.0407                                         min =          7
     between = 0.1101                                         avg =        7.0
     overall = 0.0934                                         max =          7

                                                F(1,47)           =       5.05
corr(u_i, Xb)  = -0.6885                        Prob > F          =     0.0294

                                 (Std. Err. adjusted for 48 clusters in state)
------------------------------------------------------------------------------
             |               Robust
      vfrall |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     beertax |  -.6558736   .2918556    -2.25   0.029    -1.243011   -.0687358
       _cons |   2.377075   .1497966    15.87   0.000     2.075723    2.678427
-------------+----------------------------------------------------------------
     sigma_u |   .7147146
     sigma_e |  .18985942
         rho |  .93408484   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. * Get overall Adjusted Rsquared;
.  qui areg vfrall beertax, absorb(state);

.  dis "Adjusted Rsquared = " e(r2_a);
Adjusted Rsquared = .88912864

. **** Col(3);
. xtreg vfrall beertax y82 y83 y84 y85 y86 y87, fe vce(cluster state);

Fixed-effects (within) regression               Number of obs     =        336
Group variable: state                           Number of groups  =         48

R-sq:                                           Obs per group:
     within  = 0.0803                                         min =          7
     between = 0.1101                                         avg =        7.0
     overall = 0.0876                                         max =          7

                                                F(7,47)           =       4.36
corr(u_i, Xb)  = -0.6781                        Prob > F          =     0.0009

                                 (Std. Err. adjusted for 48 clusters in state)
------------------------------------------------------------------------------
             |               Robust
      vfrall |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     beertax |  -.6399799   .3570783    -1.79   0.080    -1.358329    .0783691
         y82 |   .0518038   .0644023     0.80   0.425    -.0777568    .1813645
         y83 |  -.0280991   .0528959    -0.53   0.598    -.1345119    .0783138
         y84 |  -.0206167   .0398023    -0.52   0.607    -.1006887    .0594552
         y85 |  -.0721725   .0376438    -1.92   0.061    -.1479021    .0035572
         y86 |   .0139393   .0287262     0.49   0.630    -.0438503     .071729
         y87 |   .0009018   .0287037     0.03   0.975    -.0568427    .0586462
       _cons |   2.376666   .1673381    14.20   0.000     2.040025    2.713307
-------------+----------------------------------------------------------------
     sigma_u |  .70945965
     sigma_e |  .18788295
         rho |  .93446372   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. test y82 y83 y84 y85 y86 y87;

 ( 1)  y82 = 0
 ( 2)  y83 = 0
 ( 3)  y84 = 0
 ( 4)  y85 = 0
 ( 5)  y86 = 0
 ( 6)  y87 = 0

       F(  6,    47) =    4.22
            Prob > F =    0.0018

.  * Get overall Adjusted Rsquared;
.  qui areg vfrall beertax y82 y83 y84 y85 y86 y87, absorb(state);

.  dis "Adjusted Rsquared = " e(r2_a);
Adjusted Rsquared = .891425

. **** Col(4);
. xtreg vfrall beertax da18 da19 da20 jailcom vmilespd unrate lincperc y82 y83 y84 y85 y86 y87, fe vce(cluster state);

Fixed-effects (within) regression               Number of obs     =        335
Group variable: state                           Number of groups  =         48

R-sq:                                           Obs per group:
     within  = 0.3894                                         min =          6
     between = 0.3255                                         avg =        7.0
     overall = 0.2310                                         max =          7

                                                F(14,47)          =       9.34
corr(u_i, Xb)  = -0.8428                        Prob > F          =     0.0000

                                 (Std. Err. adjusted for 48 clusters in state)
------------------------------------------------------------------------------
             |               Robust
      vfrall |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     beertax |  -.4453443   .2972117    -1.50   0.141    -1.043257    .1525684
        da18 |   .0284457   .0697981     0.41   0.685      -.11197    .1688614
        da19 |  -.0179531   .0499765    -0.36   0.721    -.1184929    .0825867
        da20 |   .0320213   .0505116     0.63   0.529    -.0695949    .1336375
     jailcom |   .0383309   .1029619     0.37   0.711    -.1688017    .2454635
    vmilespd |   .0082281   .0068413     1.20   0.235    -.0055348    .0219911
      unrate |  -.0632598   .0132147    -4.79   0.000    -.0898444   -.0366752
    lincperc |   1.815772   .6361471     2.85   0.006     .5360088    3.095535
         y82 |   .5324157   .0918677     5.80   0.000     .3476018    .7172296
         y83 |   .4343258   .0852894     5.09   0.000     .2627457     .605906
         y84 |   .2449435   .0598576     4.09   0.000     .1245255    .3653614
         y85 |   .1538222   .0514089     2.99   0.004     .0504008    .2572436
         y86 |   .1884676   .0396962     4.75   0.000     .1086091    .2683261
         y87 |   .0867712   .0306619     2.83   0.007     .0250875    .1484549
       _cons |  -2.329926   1.781159    -1.31   0.197    -5.913156    1.253304
-------------+----------------------------------------------------------------
     sigma_u |  .90041446
     sigma_e |  .15531245
         rho |  .97110687   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. test y82 y83 y84 y85 y86 y87;

 ( 1)  y82 = 0
 ( 2)  y83 = 0
 ( 3)  y84 = 0
 ( 4)  y85 = 0
 ( 5)  y86 = 0
 ( 6)  y87 = 0

       F(  6,    47) =   10.12
            Prob > F =    0.0000

. test da18 da19 da20;

 ( 1)  da18 = 0
 ( 2)  da19 = 0
 ( 3)  da20 = 0

       F(  3,    47) =    0.35
            Prob > F =    0.7859

. test unrate lincperc;

 ( 1)  unrate = 0
 ( 2)  lincperc = 0

       F(  2,    47) =   29.62
            Prob > F =    0.0000

. * Get overall Adjusted Rsquared;
.  qui areg vfrall beertax da18 da19 da20 jailcom vmilespd unrate lincperc y82 y83 y84 y85 y86 y87, absorb(state);

.  dis "Adjusted Rsquared = " e(r2_a);
Adjusted Rsquared = .92601492

. **** Col(5);
. xtreg vfrall beertax da18 da19 da20 jailcom vmilespd y82 y83 y84 y85 y86 y87, fe vce(cluster state);

Fixed-effects (within) regression               Number of obs     =        335
Group variable: state                           Number of groups  =         48

R-sq:                                           Obs per group:
     within  = 0.1091                                         min =          6
     between = 0.0715                                         avg =        7.0
     overall = 0.0534                                         max =          7

                                                F(12,47)          =       2.93
corr(u_i, Xb)  = -0.6611                        Prob > F          =     0.0041

                                 (Std. Err. adjusted for 48 clusters in state)
------------------------------------------------------------------------------
             |               Robust
      vfrall |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     beertax |  -.6899219   .3522085    -1.96   0.056    -1.398474    .0186302
        da18 |  -.0103719   .0825317    -0.13   0.901    -.1764042    .1556604
        da19 |  -.0757019   .0676776    -1.12   0.269    -.2118516    .0604478
        da20 |  -.1001451   .0559349    -1.79   0.080    -.2126716    .0123815
     jailcom |   .0852844   .1115552     0.76   0.448    -.1391358    .3097045
    vmilespd |   .0174361    .010517     1.66   0.104    -.0037213    .0385935
         y82 |   .1201203   .0787114     1.53   0.134    -.0382266    .2784672
         y83 |   .0302539   .0619364     0.49   0.627    -.0943461     .154854
         y84 |   .0255706   .0489624     0.52   0.604    -.0729291    .1240704
         y85 |  -.0300249   .0452692    -0.66   0.510    -.1210948     .061045
         y86 |   .0417473   .0324196     1.29   0.204    -.0234725     .106967
         y87 |   .0137788   .0290487     0.47   0.637    -.0446597    .0722174
       _cons |    2.22462   .1798686    12.37   0.000     1.862771     2.58647
-------------+----------------------------------------------------------------
     sigma_u |  .71079122
     sigma_e |   .1869146
         rho |  .93532103   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. test y82 y83 y84 y85 y86 y87;

 ( 1)  y82 = 0
 ( 2)  y83 = 0
 ( 3)  y84 = 0
 ( 4)  y85 = 0
 ( 5)  y86 = 0
 ( 6)  y87 = 0

       F(  6,    47) =    3.48
            Prob > F =    0.0063

. test da18 da19 da20;

 ( 1)  da18 = 0
 ( 2)  da19 = 0
 ( 3)  da20 = 0

       F(  3,    47) =    1.41
            Prob > F =    0.2528

. * Get overall Adjusted Rsquared;
.  qui areg vfrall beertax da18 da19 da20 jailcom vmilespd y82 y83 y84 y85 y86 y87, absorb(state);

.  dis "Adjusted Rsquared = " e(r2_a);
Adjusted Rsquared = .89284361

. **** Col(6);
. xtreg vfrall beertax mlda jailcom vmilespd unrate lincperc y82 y83 y84 y85 y86 y87, fe vce(cluster state);

Fixed-effects (within) regression               Number of obs     =        335
Group variable: state                           Number of groups  =         48

R-sq:                                           Obs per group:
     within  = 0.3863                                         min =          6
     between = 0.3170                                         avg =        7.0
     overall = 0.2245                                         max =          7

                                                F(12,47)          =      10.35
corr(u_i, Xb)  = -0.8395                        Prob > F          =     0.0000

                                 (Std. Err. adjusted for 48 clusters in state)
------------------------------------------------------------------------------
             |               Robust
      vfrall |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     beertax |  -.4564667   .3068075    -1.49   0.143    -1.073684    .1607505
        mlda |  -.0021568   .0215195    -0.10   0.921    -.0454483    .0411348
     jailcom |   .0389814   .1031609     0.38   0.707    -.1685515    .2465143
    vmilespd |   .0089787   .0070975     1.27   0.212    -.0052996    .0232569
      unrate |  -.0626944   .0132294    -4.74   0.000    -.0893085   -.0360803
    lincperc |   1.786436   .6433923     2.78   0.008      .492098    3.080775
         y82 |   .5285644   .0915844     5.77   0.000     .3443204    .7128084
         y83 |   .4301052   .0845964     5.08   0.000     .2599192    .6002912
         y84 |    .242009   .0598799     4.04   0.000     .1215461    .3624718
         y85 |   .1514036   .0515159     2.94   0.005     .0477671    .2550402
         y86 |   .1862771   .0395456     4.71   0.000     .1067215    .2658327
         y87 |   .0880108   .0309067     2.85   0.007     .0258346    .1501869
       _cons |  -2.210716   1.938533    -1.14   0.260    -6.110542    1.689109
-------------+----------------------------------------------------------------
     sigma_u |  .89598953
     sigma_e |  .15513374
         rho |  .97089426   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. test y82 y83 y84 y85 y86 y87;

 ( 1)  y82 = 0
 ( 2)  y83 = 0
 ( 3)  y84 = 0
 ( 4)  y85 = 0
 ( 5)  y86 = 0
 ( 6)  y87 = 0

       F(  6,    47) =   10.28
            Prob > F =    0.0000

. test unrate lincperc;

 ( 1)  unrate = 0
 ( 2)  lincperc = 0

       F(  2,    47) =   31.96
            Prob > F =    0.0000

. * Get overall Adjusted Rsquared;
.  qui areg vfrall beertax mlda jailcom vmilespd unrate lincperc y82 y83 y84 y85 y86 y87, absorb(state);

.  dis "Adjusted Rsquared = " e(r2_a);
Adjusted Rsquared = .92618509

. keep if (year==1988) | (year==1982);
(240 observations deleted)

. **** Col(7);
. xtreg vfrall beertax da18 da19 da20 jailcom vmilespd unrate lincperc y82, fe vce(cluster state);

Fixed-effects (within) regression               Number of obs     =         95
Group variable: state                           Number of groups  =         48

R-sq:                                           Obs per group:
     within  = 0.6602                                         min =          1
     between = 0.0573                                         avg =        2.0
     overall = 0.0168                                         max =          2

                                                F(9,47)           =       9.62
corr(u_i, Xb)  = -0.7475                        Prob > F          =     0.0000

                                 (Std. Err. adjusted for 48 clusters in state)
------------------------------------------------------------------------------
             |               Robust
      vfrall |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     beertax |  -.9256028   .3427258    -2.70   0.010    -1.615078   -.2361275
        da18 |   .0374495    .102409     0.37   0.716    -.1685707    .2434698
        da19 |  -.0648848   .0986212    -0.66   0.514     -.263285    .1335153
        da20 |  -.1126598   .1251922    -0.90   0.373     -.364514    .1391945
     jailcom |    .089042   .1640181     0.54   0.590    -.2409198    .4190038
    vmilespd |   .1243501   .0487739     2.55   0.014     .0262296    .2224705
      unrate |  -.0907823   .0208809    -4.35   0.000    -.1327892   -.0487754
    lincperc |    .995513   .6774687     1.47   0.148    -.3673781    2.358404
         y82 |   .7508698   .1226255     6.12   0.000     .5041792    .9975605
       _cons |  -.7576814   1.917319    -0.40   0.694    -4.614831    3.099468
-------------+----------------------------------------------------------------
     sigma_u |     .87817
     sigma_e |  .19059386
         rho |   .9550147   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. test y82;

 ( 1)  y82 = 0

       F(  1,    47) =   37.49
            Prob > F =    0.0000

. test da18 da19 da20;

 ( 1)  da18 = 0
 ( 2)  da19 = 0
 ( 3)  da20 = 0

       F(  3,    47) =    0.42
            Prob > F =    0.7384

. test unrate lincperc;

 ( 1)  unrate = 0
 ( 2)  lincperc = 0

       F(  2,    47) =   25.20
            Prob > F =    0.0000

. * Get overall Adjusted Rsquared;
.  qui areg vfrall beertax da18 da19 da20 jailcom vmilespd unrate lincperc y82, absorb(state);

.  dis "Adjusted Rsquared = " e(r2_a);
Adjusted Rsquared = .89868377

. log close;
      name:  <unnamed>
       log:  /Users/mwatson/Dropbox/TB/4E/WebSupplements/ForStudents/SW_4E_ReplicationFiles/Chapter_10/ch10.log
  log type:  text
 closed on:  24 Sep 2018, 15:06:56
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
