--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/mwatson/Dropbox/TB/4E/WebSupplements/ForStudents/SW_4E_ReplicationFiles/Chapter_8/ch8_eq820.log
  log type:  text
 opened on:  24 Sep 2018, 14:59:31

. ***********************************;
. * Read In Data;
.  use "/Users/mwatson/Dropbox/TB/4E/WebSupplements/ForStudents/SW_4E_ReplicationFiles/Replication_Data/ch8_cps.dta";

. desc;

Contains data from /Users/mwatson/Dropbox/TB/4E/WebSupplements/ForStudents/SW_4E_ReplicationFiles/Replication_Data/ch8_cps.dta
  obs:        59,668                          
 vars:             8                          29 Oct 2017 11:53
 size:     1,909,376                          (_dta has notes)
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
ahe             float   %9.0g                 
yrseduc         float   %9.0g                 
female          float   %9.0g                 
age             float   %9.0g                 
northeast       float   %9.0g                 
midwest         float   %9.0g                 
south           float   %9.0g                 
west            float   %9.0g                 
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: 

. *************************************************************;
. keep if (age >= 21) & (age <= 64);
(3,264 observations deleted)

. keep if (yrseduc == 16);
(42,582 observations deleted)

. gen lahe = ln(ahe);

. summarize ahe age lahe, detail;

                             ahe
-------------------------------------------------------------
      Percentiles      Smallest
 1%     5.769231       2.019231
 5%     10.09615       2.040816
10%     13.09524       2.307692       Obs              13,822
25%     18.26923       2.307692       Sum of Wgt.      13,822

50%     26.44231                      Mean           30.94349
                        Largest       Std. Dev.      18.18981
75%     38.46154       144.2308
90%     55.28846       144.2308       Variance       330.8691
95%     67.30769       148.3517       Skewness        1.55474
99%     96.15385       159.3137       Kurtosis       6.556145

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%           23             21
 5%           25             21
10%           27             21       Obs              13,822
25%           33             21       Sum of Wgt.      13,822

50%           41                      Mean           41.64506
                        Largest       Std. Dev.      10.91972
75%           50             64
90%           57             64       Variance       119.2402
95%           60             64       Skewness       .1531906
99%           63             64       Kurtosis       1.995525

                            lahe
-------------------------------------------------------------
      Percentiles      Smallest
 1%     1.752539       .7027166
 5%     2.312155       .7133499
10%     2.572249        .836248       Obs              13,822
25%     2.905218        .836248       Sum of Wgt.      13,822

50%     3.274965                      Mean           3.273282
                        Largest       Std. Dev.      .5745499
75%     3.649659       4.971415
90%     4.012564       4.971415       Variance       .3301076
95%     4.209275       4.999586       Skewness      -.2362821
99%     4.565949       5.070875       Kurtosis       3.415491

. regress lahe age, robust;

Linear regression                               Number of obs     =     13,822
                                                F(1, 13820)       =     451.70
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0328
                                                Root MSE          =     .56507

------------------------------------------------------------------------------
             |               Robust
        lahe |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0095278   .0004483    21.25   0.000      .008649    .0104065
       _cons |   2.876498   .0188461   152.63   0.000     2.839557    2.913439
------------------------------------------------------------------------------

. dis "Adjusted Rsquared = " _result(8);
Adjusted Rsquared = .03272061

. graph twoway scatter lahe age;

. *************************************************************;
. log close;
      name:  <unnamed>
       log:  /Users/mwatson/Dropbox/TB/4E/WebSupplements/ForStudents/SW_4E_ReplicationFiles/Chapter_8/ch8_eq820.log
  log type:  text
 closed on:  24 Sep 2018, 14:59:34
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
