--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/mwatson/Dropbox/TB/4E/ReplicationMaterials/Ch8/returns_to_education_box.log
  log type:  text
 opened on:  29 Oct 2017, 12:36:53

. ***********************************;
. * Read In Data;
.  * (Note: Change path name so that it is appropriate for your computer);
. use /Users/mwatson/Dropbox/TB/4E/replicationmaterials/finaldata/ch8_cps.dta;

. *;
. keep if (age >= 30) & (age <= 64);
(12435 observations deleted)

. desc;

Contains data from /Users/mwatson/Dropbox/TB/4E/replicationmaterials/finaldata/ch8_cps.dta
  obs:        47,233                          
 vars:             8                          29 Oct 2017 11:53
 size:     1,511,456                          (_dta has notes)
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
ahe             float   %9.0g                 
yrseduc         float   %9.0g                 
female          float   %9.0g                 
age             float   %9.0g                 
northeast       float   %9.0g                 
midwest         float   %9.0g                 
south           float   %9.0g                 
west            float   %9.0g                 
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by:  
     Note:  dataset has changed since last saved

. summarize ahe;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         ahe |     47233    26.71173    17.68973   2.019231   228.3654

. summarize age;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         age |     47233    45.32378    9.395704         30         64

. summarize yrseduc;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     yrseduc |     47233    14.18989     2.65248          6         20

. *;
. gen lahe = ln(ahe);

. gen fem_yrse = female*yrseduc;

. gen male = 1-female;

. gen male_yrse = male*yrseduc;

. gen pexp = age - (yrseduc+6);

. gen pexp_2 = pexp*pexp;

. * Box in Chapter 8;
. reg lahe yrseduc, robust;

Linear regression                                      Number of obs =   47233
                                                       F(  1, 47231) =12538.25
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2094
                                                       Root MSE      =  .54406

------------------------------------------------------------------------------
             |               Robust
        lahe |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     yrseduc |   .1055672   .0009428   111.97   0.000     .1037194    .1074151
       _cons |   1.600842   .0134844   118.72   0.000     1.574413    1.627272
------------------------------------------------------------------------------

. dis "Adjusted Rsquared = " _result(8);
Adjusted Rsquared = .20940271

. *;
. reg lahe female yrseduc, robust;

Linear regression                                      Number of obs =   47233
                                                       F(  2, 47230) = 7901.70
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2509
                                                       Root MSE      =  .52962

------------------------------------------------------------------------------
             |               Robust
        lahe |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -.2515445   .0048865   -51.48   0.000    -.2611221   -.2419669
     yrseduc |   .1089044   .0009214   118.19   0.000     .1070984    .1107104
       _cons |   1.664138   .0131921   126.15   0.000     1.638281    1.689995
------------------------------------------------------------------------------

. dis "Adjusted Rsquared = " _result(8);
Adjusted Rsquared = .25081832

. *;
. reg lahe female yrseduc fem_yrse, robust;

Linear regression                                      Number of obs =   47233
                                                       F(  3, 47229) = 5326.38
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2510
                                                       Root MSE      =  .52956

------------------------------------------------------------------------------
             |               Robust
        lahe |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -.3417269   .0264556   -12.92   0.000    -.3935803   -.2898735
     yrseduc |   .1062528    .001237    85.90   0.000     .1038283    .1086772
    fem_yrse |   .0063315   .0018487     3.42   0.001     .0027081    .0099549
       _cons |   1.701323   .0174604    97.44   0.000       1.6671    1.735546
------------------------------------------------------------------------------

. dis "Adjusted Rsquared = " _result(8);
Adjusted Rsquared = .25098491

.  test yrseduc fem_yrse;

 ( 1)  yrseduc = 0
 ( 2)  fem_yrse = 0

       F(  2, 47229) = 7046.97
            Prob > F =    0.0000

. *;
. reg lahe male yrseduc male_yrse, robust;

Linear regression                                      Number of obs =   47233
                                                       F(  3, 47229) = 5326.38
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2510
                                                       Root MSE      =  .52956

------------------------------------------------------------------------------
             |               Robust
        lahe |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .3417269   .0264556    12.92   0.000     .2898735    .3935803
     yrseduc |   .1125843   .0013738    81.95   0.000     .1098915     .115277
   male_yrse |  -.0063315   .0018487    -3.42   0.001    -.0099549   -.0027081
       _cons |   1.359596   .0198755    68.41   0.000      1.32064    1.398552
------------------------------------------------------------------------------

. *;
. reg lahe female yrseduc fem_yrse pexp pexp_2
>         midwest south west, robust;

Linear regression                                      Number of obs =   47233
                                                       F(  8, 47224) = 2091.50
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2618
                                                       Root MSE      =  .52578

------------------------------------------------------------------------------
             |               Robust
        lahe |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -.3678808   .0263684   -13.95   0.000    -.4195633   -.3161983
     yrseduc |   .1113974   .0012647    88.08   0.000     .1089186    .1138762
    fem_yrse |   .0081637   .0018433     4.43   0.000     .0045507    .0117766
        pexp |   .0147387   .0012665    11.64   0.000     .0122563    .0172211
      pexp_2 |  -.0001825    .000024    -7.60   0.000    -.0002295   -.0001354
     midwest |  -.0794623   .0080388    -9.88   0.000    -.0952185    -.063706
       south |  -.0880316   .0072974   -12.06   0.000    -.1023347   -.0737285
        west |   -.032696   .0077225    -4.23   0.000    -.0478322   -.0175598
       _cons |   1.448053   .0255506    56.67   0.000     1.397974    1.498133
------------------------------------------------------------------------------

. dis "Adjusted Rsquared = " _result(8);
Adjusted Rsquared = .26164734

.  test yrseduc fem_yrse;

 ( 1)  yrseduc = 0
 ( 2)  fem_yrse = 0

       F(  2, 47224) = 6946.33
            Prob > F =    0.0000

.  test pexp pexp_2;

 ( 1)  pexp = 0
 ( 2)  pexp_2 = 0

       F(  2, 47224) =  245.74
            Prob > F =    0.0000

. *;
. reg lahe male yrseduc male_yrse pexp pexp_2
>         midwest south west, robust;

Linear regression                                      Number of obs =   47233
                                                       F(  8, 47224) = 2091.50
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2618
                                                       Root MSE      =  .52578

------------------------------------------------------------------------------
             |               Robust
        lahe |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .3678808   .0263684    13.95   0.000     .3161983    .4195633
     yrseduc |    .119561   .0014256    83.87   0.000     .1167668    .1223552
   male_yrse |  -.0081637   .0018433    -4.43   0.000    -.0117766   -.0045507
        pexp |   .0147387   .0012665    11.64   0.000     .0122563    .0172211
      pexp_2 |  -.0001825    .000024    -7.60   0.000    -.0002295   -.0001354
     midwest |  -.0794623   .0080388    -9.88   0.000    -.0952185    -.063706
       south |  -.0880316   .0072974   -12.06   0.000    -.1023347   -.0737285
        west |   -.032696   .0077225    -4.23   0.000    -.0478322   -.0175598
       _cons |   1.080172   .0281098    38.43   0.000     1.025077    1.135268
------------------------------------------------------------------------------

. *************************************************************;
. log close;
      name:  <unnamed>
       log:  /Users/mwatson/Dropbox/TB/4E/ReplicationMaterials/Ch8/returns_to_education_box.log
  log type:  text
 closed on:  29 Oct 2017, 12:36:53
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
